In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from IPython.display import display

%pylab inline
pylab.rcParams['figure.figsize'] = (18, 5)
pd.set_option('display.max_rows', None)

Populating the interactive namespace from numpy and matplotlib

In [17]:
df = pd.DataFrame([[1, 2], [1.4, np.nan], [1.3, 3]])
display(df)

df[[0, 1]].min(axis=1)

     0    1
0  1.0  2.0
1  1.4  NaN
2  1.3  3.0

0    1.0
1    1.4
2    1.3
dtype: float64

In [5]:
display(df.mean(axis=0))
display(np.mean(df.values, axis=0))

0    1.233333
1    2.500000
dtype: float64

array([1.23333333,        nan])

In [7]:
data = {
    'city': ['NY','NY', 'SF','SF','SF'],
    'cuisine': ['Japanese', 'Chinese', 'French', 'Japanese', 'Japanese']
}

df = pd.DataFrame(data)
df

  city   cuisine
0   NY  Japanese
1   NY   Chinese
2   SF    French
3   SF  Japanese
4   SF  Japanese

In [8]:
df["value"]=1
pd.pivot_table(df, values="value", index=["city"], columns="cuisine", fill_value=0, aggfunc=len)

cuisine  Chinese  French  Japanese
city
NY             1       0         1
SF             0       1         2

In [10]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value': np.random.randn(4)})
df2 = pd.DataFrame({'key': ['B', 'D', 'D', 'E'], 'value': np.random.randn(4)})
display(df1)
display(df2)

pd.merge(df1, df2, on='key')

  key     value
0   A  0.296859
1   B -0.055968
2   C -1.813713
3   D -0.594081

  key     value
0   B  1.365079
1   D -0.516345
2   D  0.823390
3   E -0.156237

  key   value_x   value_y
0   B -0.055968  1.365079
1   D -0.594081 -0.516345
2   D -0.594081  0.823390